from pymongo import MongoClient
from dotenv import load_dotenv
import os

load_dotenv()
mongoUrl = os.environ["MONGO_URI"] = os.getenv("MONGO_URI")

# def check_rule_by_supplier_name(supplier_name):
#     """
#     根據出版商名稱查詢建檔規則
#     """
#     client = MongoClient(
#         "mongodb+srv://tommy:pN3hJwrbAnb4ESoV@test1.fjnut.mongodb.net/"
#     )
#     db = client["test"]
#     collection = db["rules"]
#     query = {"supplier_name": supplier_name}
#     results = collection.find(query)
#     print(results)
#     rules_list = []
#     for result in results:
#         print(result)
#         rules_list.append(result.get("rules", []))
#     return rules_list


# results = check_rule_by_supplier_name("上誼文化")
# print(results)


def insert_collected_content():
    client = MongoClient(mongoUrl)
    db = client["DocAgent"]
    collection = db["standard_form"]
    new_data = {
        "供應商代碼": "",
        "出版社代碼": "",
        "原文出版社": "健行文化",
        "商品條碼(EAN)": "4713302431538",
        "ISBN/ISSN": "9786267207598",
        "EISBN": "",
        "商品貨號": "0299042",
        "業種別": "11",
        "主要商品名稱": "遺族的生命與轉變套書（無臉雌雄＋一百零一個活下來的理由）",
        "次要商品名稱": "",
        "期數": "",
        "主要作者": "杜秀娟",
        "次要作者": "",
        "出版日期": "20240328",
        "譯者": "",
        "編者": "",
        "繪者": "",
        "頁數": "672",
        "冊數": "",
        "版別": "",
        "出版國": "",
        "內容語言別": "01",
        "語文對照": "",
        "注音註記": "N",
        "印刷模式": "A",
        "編排型式": "B",
        "出版型式": "D",
        "裝訂型式": "A",
        "裝訂型式補述": "",
        "叢書名稱(書系)": "i健康",
        "CIP": "178.8",
        "學思行分類": "",
        "商品內容分級": "A",
        "適合年齡(起": "",
        "適合年齡(迄": "",
        "商品單位代碼": "A",
        "商品定價": "840",
        "商品特價": "790",
        "商品批價": "",
        "進貨折扣": "",
        "銷售地區限制": "B",
        "海外商品原幣別": "",
        "海外商品原定價": "",
        "商品銷售稅別": "",
        "商品長度": "148",
        "商品寛度": "210",
        "商品高度": "",
        "商品重量": "",
        "特別收錄／編輯的話": "",
        "商品簡介": "臺灣第一本用神話角度書寫自殺者遺族的歷程，是遺族面對自殺者的真情告白。結合遺族經驗與榮格的積極想像與煉金術，用生來看死，也用死來看生，情摯動人。以蜿蜒的筆觸，不慍不怒書寫一則未曾存在、由死入生的人間神話，翻轉破碎的人生。面對對自殺者和其遺族的污名化，讓類似經驗的讀者可以共鳴。臺灣第一本自殺者遺族公開親身經驗的全書，與你分享最悲痛的心情以及被留下來的人該如何繼續活下去的勇氣！本書結合遺族倖存經驗與療癒相關理論，有研究論述結合個體經驗的價值，不僅讓社會看到遺族的多元面向，也適合經歷其他創傷而對生命存疑的個體閱讀。",
        "封面故事": "",
        "作者簡介": "杜秀娟，2006年臺北藝術大學戲劇研究所畢業，主修戲劇理論。相關獲獎紀錄有2002年第二屆帝門藝評獎「生活寫作」組入選，2008年第二屆「浴火重生」另類文學獎第二名，2009年國藝會「台灣藝文評論徵選專案」佳作。旅英八年，2015年獲頒英國University of Essex精神分析研究博士（榮格理論、非臨床）。曾擔任英國公益團體Suicide Bereaved Network董事（2015~2017）。近期於2018年獲國藝會「表演藝術評論人專案」補助。2020年譯有《虛擬真實：沉浸式劇場創作祕笈》（Creating Worlds: How to Make Immersive Theatre,書林）。2023年出版《一百零一個活下來的理由——如何面對自殺情結》（健行文化），入圍2023年Openbook好書獎【年度生活書】項目。",
        "譯者簡介": "",
        "內容頁次": "",
        "前言／序": "",
        "內文試閱": "",
        "名人導讀": "",
        "媒体推薦": "",
        "名人推薦": "",
        "得獎紀錄": "",
        "目錄／曲目": "《無臉雌雄》    \n推薦序 跨越時空的祝福與安慰／鄭玉英 \n第一部分 未曾存在的神話\n1 開場白 \n2 序曲 \n3 惡事現前\n4 天問 \n5 失序的宇宙\n6 在魚肚腹的生活\n7 縫隙中的掙扎 \n8 新的秩序\n9 最後一哩路\n10 終曲 \n11 跋 \n第二部分 關於理論\n何為自殺者遺族 \n失落、悲傷與哀悼歷程\n創傷\n繼續連結理論\n韌性與創傷後成長\n帕帕多波羅的「創傷方格」的理論\n遺族的總體經驗\n總體經驗的背後\n如何營造正面的成長\n心理重建的任務 \n從哀傷到希望 \n第三部分 整合的兩把金鑰匙\n積極想像\n煉金術的意象\n我的玫瑰園\n總結\n註釋\n《一百零一個活下來的理由》",
        "附加商品標題": "",
        "附加商品內容": "",
        "絕版註記": "",
        "外幣兌匯率": "",
        "有庫存才賣註記": "",
        "二手書銷售註記": "",
        "系列代碼": "",
        "廠商店內碼": "",
        "紙張開數": "",
        "關鍵字詞": "",
        "商品截退日期": "",
        "銷售通路限制": "",
        "首批進倉日期": "",
        "(商品)隨貨附件": "",
    }
    result = collection.insert_one(new_data)
    if result.inserted_id:
        return "資料插入成功"
    else:
        return "插入資料失敗"


insert_collected_content()
